Repository: Alexis211/MagicWar
Catalog: po/*.po
Languages: fr

source: Hi, this is MagicWar server
fr: Salut, c'est le serveur MagicWar qui parle

source: Invalid video mode. Reverting to best supported.
fr: Mode video incorrect. Utilisation du meilleur mode supporté à la place.

source: MagicWar 2D interface main window
fr: Fenêtre principale de l'interface 2D de MagicWar

source: cannot load font (2D interface)
fr: impossible de charger la police d'écriture (interface 2D)

source: Welcome to MagicWar. Game engine is currently loading ressources.
fr: Bienvenu sur MagicWar. Le moteur est en train de charger les ressources du jeu.

source: Hai ! Welcome to MagicWar's main menu. Your choices are : L : Local game N : Network game Q or Escape : exit
fr: Plop ! Bienvenue dans le menu principal de MagicWar. Vos choix sont : L : Jeu en local N : Jeu en réseau Q ou Échap : quitter

source: Bye, and thanks for playing MagicWar.
fr: Ciao, et merci de jour à MagicWar.

source: //////////// WELCOME TO MAGICWAR !!! ////////////
fr: /////////// BIENVENUE À MAGICWAR !!! ////////////

source: This command line interface is a debugging and testing tool, don't use it seriously to play.
fr: Cette interface en ligne de commande est un outi de débuggage et de test, ne l'uilisez pas pour jouer serieusement.

source: >> Game is loading data. <<
fr: >> Chargement des données du jeu. <<

source: MagicWar main menu :
fr: Menu principal de MagicWar :

source: 0. Quit
fr: 0. Quitter

source: 1. Local game
fr: 1. Jeu en local

source: 2. Network game
fr: 2. Jeu en réseau

source: Your choice :
fr: Votre choix :

source: MagicWar was created by the people listed in the --about screen.
fr: MagicWar a été créé par les personnes listées dans la page --about.

source: How many players do you want ? (0 = exit)
fr: Combien de joueurs voulez-vous ? (0 = qutiter)

source: Initial gold for each player :
fr: Quantité de départ d'or pour chaque joueur :

source: Initial wood for each player :
fr: Quantité de départ de bois pour chaque joueur :

source: *** Configuration for player
fr: *** Configuration du joueur

source: This player will be you!
fr: Ce joueur sera vous !

source: Enter player name :
fr: Entrez le nom du joueur :

source: Enter player faction :
fr: Entrez la faction du joueur :

source: Play in superuser mode (1 = yes, other = no) ?
fr: Jouer en mode superutilisateur (1 = oui, autre = non) ?

source: Ok, starting game !
fr: Ok, lancement du jeu !

source: Not implemented yet.
fr: Pas encore implémenté.

source: * You have :
fr: * Vous avez :

source: units of gold,
fr: unités d'or,

source: units of wood
fr: unités de bois

source: * Money (gold,wood) :
fr: * Argent (or,bois) :

source: :0 Refresh
fr: :0 Actualiser

source: :1 Exit
fr: :1 Quitter

source: :2 Make a unit do nothing
fr: :2 Faire qu'une unité ne fasse rien

source: :3 Make a unit attack another unit
fr: :3 Faire qu'une unité attaque une autre unité

source: :4 Make a unit heal/repair/build another unit
fr: :4 Faire qu'une unité soigne/répare/construise une autre unité

source: :5 Make a unit mine another unit
fr: :5 Faire qu'une unité aille miner une autre unité

source: :6 Make a unit harvest another unit
fr: :6 Faire qu'une unité aille chercher du bois sur une autre unité

source: :7 Make a unit ameliorate
fr: :7 Faire s'améliorer une unité

source: :8 Make a unit build something
fr: :8 Faire constuire quelque chose à une unité

source: :9 Make a unit produce something
fr: :9 Faire produire quelque chose à une unité

source: Enter unit number :
fr: Entrez le numéro de l'unité :

source: Enter attacker number :
fr: Entrez le numéro de l'unité attaquante :

source: Enter attacked unit number :
fr: Entrez le numéro de l'unité attaquée :

source: Enter healer number :
fr: Entrez le numéro de l'unité soignante :

source: Enter healed unit number :
fr: Entrez le numéro de l'unité soignée :

source: Enter miner number :
fr: Entrez le numéro du mineur :

source: Enter mined unit number :
fr: Entrez le numéro de l'unité minée :

source: Enter harvester number :
fr: Entrez le numéro de l'ammasseur :

source: Enter harvested unit number :
fr: Entrez le numéro de l'arbre :

source: Enter ameliorated unit number :
fr: Entrez le numéro de l'unité améliorée :

source: :0 Cancel
fr: :0 Annuller

source: Enter builder unit number :
fr: Entrez le numéro de l'unité constructrice :

source: Not enough money.
fr: Pas assez d'argent

source: Enter producer unit number :
fr: Entrez le numéro de l'unité productrice :

source: Configuration file does not exist, using default configuration values.
fr: Le fichier de configuration n'existe pas, utilisation des valeurs par défaut.

source: MagicWar is free software, distributed under GNU GPL.
fr: MagicWar est un logiciel libre, distribué sous license GNU GPL.

source: MagicWar is written by :
fr: MagicWar a été écrit par :

source: Ideas : Bhan666
fr: Idées : Bhan666

source: Graphics : (nobody)
fr: Graphismes : (personne)

source: Translation : (translators, insert your names here)
fr: Traduction : traduction française par Alexis211

source: --about prints various informations about program
fr: --about affiche diverses informations à propos du programme

source: --help prints this help screen
fr: --help affiche cet écran d'aide

source: --cliface use command line interface for game (used for developpement)
fr: --cliface utiliser l'interface en ligne de commande (utilisé pour le développement)

source: --iface2d use 2D interface for game (used for developpement)
fr: --iface2d utiliser l'interface 2D pour le jeu (utilisé pour le développement)

source: --iface3d use 3D interface for game
fr: --iface3d utiliser l'interface 3D pour le jeu

source: For more options, try editing configuration file :
fr: Pour plus d'options, essayez d'éditer le fichier de configuration :

source: 3D interface disabled, reverting to CL interface.
fr: L'interface 3D est désactivée, utilisation de l'interface en ligne de commande à la place.

source: NOTICE :
fr: REMARQUE :

source: WARNING :
fr: ATTENTION :

source: ERROR :
fr: ERREUR :

source: CRITICAL :
fr: CRITIQUE :

source: Nature
fr: Mère Nature

source: Loading unit types...
fr: Chargement des types d'unités...

source: Cannot read unit list
fr: Impossible de lire la liste des unités

source: Cannot load data for unit
fr: Impossible de charger les informations pour l'unité

source: Loading factions...
fr: Chargement des factions...

source: These units belong to the nature.
fr: Ces unités appartiennent à mère nature.

source: Faction with no name
fr: Faction sans nom

source: Unit with a faction with no name
fr: Unité avec une faction sans nom

source: Faction that has no description
fr: Faction avec pas de description

source: Base unit for forecasters.
fr: Unité de base pour les devins.

source: Ritual Circle
fr: Cercle de rituel

source: Base meeting place for forecasters.
fr: Lieu de rencontre de base des devins

source: Power enhancement
fr: Augmentation de puissance

source: The ritual circle becomes... MORE POWERFUL!!!
fr: Le cercle de rituel devient... PLUS PUISSSANT !!!

source: Forecasters
fr: Devins

source: Forecaster
fr: Devin

source: Druids
fr: Druides

source: Druid
fr: Druide

source: Priests
fr: Prêtres

source: Priest
fr: Prêtre

source: Mysticals
fr: Mystiques

source: Mystical
fr: Mystique
